//USER48GS JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(,4),REGION=0M,COND=(16,LT)
//SORTSTEP EXEC PGM=SORT
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DSN=&SYSUID.LEARN.HOSP.WARD,DISP=SHR
//SORTOUT DD DSN=&SYSUID.LEARN.HOSP.WARD1.DATA,DISP=(NEW,CATLG,DELETE),
//           STORCLAS=USRBASE,SPACE=(TRK,(1,5),RLSE),
//           DCB=(LRECL=80,BLKSIZE=8000,RECFM=FB,DSORG=PS)
//SYSIN DD *
  SORT FIELDS=(1,16,CH,A,17,20,CH,A)
/*
//
//*  Original SORT statement
//*  SORT FIELDS=(99,15,CH,A)