//USER48S JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(,4),REGION=0M,COND=(16,LT)
//SORTSTEP EXEC PGM=SORT
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DSN=&SYSUID..LEARN.EMP.PROJ,DISP=SHR
//SORTOUT  DD  DSN=&SYSUID..LEARN.EMP.PROJ.SORTBY.PROJ,
//             DISP=(NEW,CATLG,DELETE),
//             STORCLAS=USRBASE,SPACE=(TRK,(12,5),RLSE),
//             DCB=(LRECL=80,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSIN DD *
  SORT FIELDS=(1,4,CH,A)
//*
//
//*  Original SORT statement
//*  SORT FIELDS=(99,15,CH,A)